app/Http/Controllers/UserController.php

    public function index(Request $request)
    {
        $key = "";
        $key .= $request->input('birth_year') ? '-year-'.$request->input('birth_year') : '';
        $key .= $request->input('birth_month') ? '-month-'.$request->input('birth_month') : '';
        $users = [];
        if (isset($request->birth_year) || isset($request->birth_month)) {
            $users = Cache::remember('users' . $key, 60, function() use($request) {
                return User::where(function($query) use($request) {
                    if (isset($request->birth_year)) {
                        $query->whereYear('birth_date', $request->birth_year);
                    }
                    if (isset($request->birth_month)) {
                        $query->whereMonth('birth_date', $request->birth_month);
                    }
                })
                ->get();
---
select * from "users" where (extract(year from "birth_date") = '1929')